InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КонтактныеЛицаКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛицаКонтрагентов</Name>
			<Comment>Контактные лица контрагентов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольКонтактногоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКонтактныхЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/IP_Softfone.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>IP_Softfone</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяЗвонка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UniqueID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоЗвонит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомуЗвонит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/IP_Softfone/Ext/Module.bsl
Функция ЗагрузитьКомпонентуТелефонии();

	// кроме веб-клиента
	#Если ВебКлиент Тогда
		Возврат Ложь;
	#КонецЕсли
	
	// константы определим отдельно, чтобы легко было менять на свои
	//Каталог=константы.IP_ПутьКФайлуВК;
	Каталог=константы.IP_ПутьКФайлуВК.Получить();
	ИмяВК="ROM-Asterisk";
	ФайлВК = Новый Файл(Каталог+"\"+ИмяВК+".dll");
	
	Если ФайлВК.Существует()=Ложь Тогда
		//Сообщить("Не найден файл внешней компоненты для связи с Asterisk");
		Возврат Ложь;
	КонецЕсли; 
	
	Попытка
		
		#Если ТолстыйКлиентОбычноеПриложение или ТолстыйКлиентУправляемоеПриложение Тогда
			Попытка
				ЗагрузитьВнешнююКомпоненту(ФайлВК.ПолноеИмя);
			Исключение
				Сообщить("Не удалось загрузить внешнюю компоненту для связи с Asterisk");
				Возврат Ложь;
			КонецПопытки; 
		#Иначе
			Если ПодключитьВнешнююКомпоненту("AddIn."+ИмяВК)=Ложь Тогда
				Сообщить("Не удалось подключить внешнюю компоненту для связи с Asterisk в режиме тонкого клиента");
				Сообщить("Если это первый запуск, то нужно войти в режиме толстого клиента");
				Возврат Ложь;
			КонецЕсли; 
		#КонецЕсли
		
		Возврат Истина;
		
	Исключение
		Сообщить("Не удалось загрузить внешнюю компоненту для связи с Asterisk 2");
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции // ЗагрузитьКомпонентуТелефонии

Функция ИнициализироватьТелефонию() ;
	// кроме веб-клиента
	#Если ВебКлиент Тогда
		Возврат Ложь;
	#КонецЕсли
	
	Причина="";
    Попытка
		_Телефония = Новый ("AddIn.ROM-Asterisk");
	Исключение
		//Сообщить("Не создать объект внешней компоненты для связи с Asterisk."+ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки; 
	
	Возврат Истина;
КонецФункции // ИнициализироватьТелефонию

// Возвращает коллекцию типа соответствие
// Вход	:
//			СтрДанные - строка с разделителями
// Выход:
//			ДанныеСобытия - Соответствие
Функция ДанныеВСоответствие(Знач Данные) ;
	
	Массив=Новый Соответствие;
	СтрБуфер=Данные;
	// Пакет может быть завершен CR-ом, без LF-а. Дополним...
	Если Прав(СтрБуфер,1)=Chars.CR Тогда
		СтрБуфер=СтрБуфер+Chars.LF;
	КонецЕсли; 
	
	// переменные для разбора строк
	CRLF=Chars.CR+Chars.LF;
	КолвоСтрок=СтрЧислоВхождений(СтрБуфер,CRLF);
	ДлинаCRLF=СтрДлина(CRLF);
	
	// переменные для разбора ключ-значение, внутри строки
	Разделитель=": ";
	ДлинаРазделителя=СтрДлина(Разделитель);

	Для Индекс=1 По КолвоСтрок Цикл
		// выборка строк, разделенных CRLF
		ПозицияCRLF=Найти(СтрБуфер,CRLF);
		ТекСтрока=Лев(СтрБуфер,ПозицияCRLF-1);
		
		// в строке, ключ и значение разделены ": "
		ПозицияРазделителя=Найти(СтрБуфер,Разделитель);
		Ключ=Лев(ТекСтрока,ПозицияРазделителя-1);
		Значение=Сред(ТекСтрока,ПозицияРазделителя+ДлинаРазделителя);
		Если ЗначениеЗаполнено(Ключ) Тогда
			Массив.Вставить(Ключ,Значение);
		КонецЕсли; 
		
		// отрезаем прочитанную часть
		СтрБуфер=Сред(СтрБуфер,ПозицияCRLF+ДлинаCRLF);
		
	КонецЦикла; 
	
	Возврат Массив;

КонецФункции //ДанныеВСоответствие

Процедура 	МояДоработка(Телефон,НомерЗаказаНаСайте=неопределено,
			СсылкаНаЗаказ=неопределено,	Ответственный=неопределено,
			КонтактноеЛицо=неопределено)
			
			Запрос = Новый Запрос;
			ТекстЗапроса="ВЫБРАТЬ ПЕРВЫЕ 1
			             |	ВложенныйЗапрос.Объект,
			             |	ВложенныйЗапрос.Ссылка
			             |ИЗ
			             |	(ВЫБРАТЬ
			             |		КонтактнаяИнформация.Объект КАК Объект,
			             |		КонтактныеЛицаКонтрагентов.Ссылка КАК Ссылка
			             |	ИЗ
			             |		РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			             |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов
			             |			ПО КонтактнаяИнформация.Объект = КонтактныеЛицаКонтрагентов.Владелец
			             |	ГДЕ
			             |		(ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(13))) = &Ном) КАК ВложенныйЗапрос
			             |
			             |УПОРЯДОЧИТЬ ПО
			             |	ВложенныйЗапрос.Ссылка.Код Убыв";
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Ном", Телефон);
			Попытка
			Результат = Запрос.Выполнить().Выгрузить().Получить(0) ;
			КонтактноеЛицо=  Строка(Результат.Ссылка);
			Контрагент=  Результат.Объект;
			Исключение
			//Сообщить("С данным Номером телефона Контрагент не зарегестрирован");
			Возврат;
			КонецПопытки;
			
			Запрос = Новый Запрос;
			ТекстЗапроса="ВЫБРАТЬ  ПЕРВЫЕ 1
			  |	ЗаказПокупателя.Ссылка,
			  |	ЗаказПокупателя.Комментарий,
			  |	ЗаказПокупателя.Контрагент,
			  |	ЗаказПокупателя.Ответственный
			  |ИЗ
			  |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
			  |ГДЕ
			  |	ЗаказПокупателя.Контрагент = &Контрагент
			  |
			  |УПОРЯДОЧИТЬ ПО
			  |ЗаказПокупателя.Ссылка Убыв";
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Контрагент", Контрагент);
			Попытка
			Результат = Запрос.Выполнить().Выгрузить().Получить(0) ;  
			НомерЗаказаНаСайте= Строка(Лев( Результат.Комментарий,7));
			СсылкаНаЗаказ=Результат.Ссылка;
			Ответственный=Строка(Результат.Ответственный );
			Исключение
			//Сообщить("По данному контрагенту заказов не зарегестрировано");
			КонецПопытки;
КОнецПроцедуры

Функция ОбновитьСписокАктивныхСоединений()
	
	//МассивСоединений = ПолучитьСоединенияИнформационнойБазы() ;
	//Для Каждого Соединение Из МассивСоединений Цикл
	//	Если Соединение.ИмяПриложения = "1CV8" Тогда 
	//		Возврат Соединение;
	//	КонецЕсли;
	//КонецЦикла;
	
	Выборка=Справочники._Телефония_Активность.Выбрать(,,,"Код Убыв"); 
	Пока Выборка.Следующий() Цикл
		 	ПервыйСеанс=Строка(Выборка.ПолучитьОбъект().Код) ;
		 	Прервать;
	КонецЦикла;
   Возврат ПервыйСеанс;
	
КонецФункции

Процедура Автоподключение() Экспорт
	        ОчиститьСправочник_Телефония_Активность();

	        ПодключитьсяНажатие();
			Если _Телефония.Подключено=1 Тогда
			//Запишем в справочник код и наименование пользователя у которого активна телефония	
			Справочник=справочники._Телефония_Активность.СоздатьЭлемент();
			Справочник.Код=НомерСеансаИнформационнойБазы();
			МассивСоединений = ПолучитьСоединенияИнформационнойБазы() ;
			Для Каждого Соединение Из МассивСоединений Цикл
				Если 	Соединение.НомерСеанса= НомерСеансаИнформационнойБазы() тогда
					Справочник.Наименование= Соединение.Пользователь.ПолноеИмя;
					прервать;
				КонецЕсли;
			КонецЦикла;	
			Справочник.Записать();	
			Сообщить("Соединение с сервером телефонии восстановлено");
	КонецЕсли; 
КонецПроцедуры

Процедура   ПодключитьОбработчик() Экспорт
	 ПодключитьОбработчикОжидания("Автоподключение",30,Ложь);

	КонецПроцедуры

	Процедура ВнешнееСобытие(Источник, Событие, Данные)Экспорт;
		//Сообщить("__________________________________________________");
		//Сообщить(          Событие);
		//Сообщить(          Данные);
		CallerID1="";
		CallerID2="";
		НомерЗаказаНаСайте="";
		СсылкаНаЗаказ="";
		Ответственный="";
		Сообщение="";
		КонтактноеЛицо="";
		
		// классификация входящих событий и перенаправление в обработчики
		ДанныеСобытия=ДанныеВСоответствие(Данные);
		Event=ВРег(СокрЛП(ДанныеСобытия.Получить("Event")));
		State=ВРег(СокрЛП(ДанныеСобытия.Получить("State")));
		UniqueID =ЛЕВ(ВРег(СокрЛП(ДанныеСобытия.Получить("Uniqueid"))),10);
		Если UniqueID="" тогда
		UniqueID=ЛЕВ(ВРег(СокрЛП(ДанныеСобытия.Получить("UniqueID"))),10);
		КонецЕсли;

		//CALLBACK начинает звонить менеджерам ,начинает играть музыка 
		//Ввыводим информацию о покупателе в служебные сообщения
		Если Event ="MUSICONHOLD"  и State="START" тогда
			
		//Проверим права пользователя(константу разрешающюю выводить информацию о зонке) 	
		СписокПрав = УправлениеПользователями.ПолучитьЗначениеПраваДляТекущегоПользователя(
		ПланыВидовХарактеристик.ПраваПользователей.IP_Tel_massage , Ложь);
		Если СписокПрав.Количество() = 0 Тогда
			ВыводитьСообщение = Ложь;
		ИначеЕсли СписокПрав.Количество() > 1 Тогда
			ВыводитьСообщение = Истина;
		Иначе
			ВыводитьСообщение = СписокПрав[0].Значение;
		КонецЕсли;

		Попытка
			Если    ВыводитьСообщение= Истина тогда	
				Справочник=Справочники.IP_Softfone.НайтиПоРеквизиту("Uniqueid",UniqueID).ПолучитьОбъект();
				Сообщение="{"+ прав(Справочник.ВремяЗвонка,8)+"}"+Справочник.Наименование+"["+ Справочник.Телефон+"]";
				Если   ЗначениеЗаполнено(Справочник.КонтактноеЛицо) тогда
					Сообщение=Сообщение+Справочник.КонтактноеЛицо;
				КонецЕсли;
				Если   ЗначениеЗаполнено(Справочник.НомерСайт) тогда
					Сообщение=Сообщение+"[Заказ:"+Справочник.НомерСайт+"]";
				КонецЕсли;
				Если   ЗначениеЗаполнено(Справочник.НомерСайт) тогда
					Сообщение=Сообщение+"Менеджер:"+Справочник.Ответственный;
				КонецЕсли;
				Сообщить(Сообщение);
			КонецЕсли;	
		Исключение ; КонецПопытки;
		КонецЕСли;
	
		//Если это не первый сеанс то в справочник ни чего не пишем 
		ПервыйСеанс=ОбновитьСписокАктивныхСоединений();
		
		Если ПервыйСеанс <> Строка(НомерСеансаИнформационнойБазы()) тогда Возврат КонецЕсли;
		
		//CALLBACK начинает звонить менеджерам ,начинает играть музыка 
		//Обновим сделаем звонок "Активным"
        Если Event ="MUSICONHOLD"  и State="START" тогда
			Попытка
			            Справочник=Справочники.IP_Softfone.НайтиПоРеквизиту("Uniqueid",UniqueID).ПолучитьОбъект();
						Справочник.Активность="А";
						Справочник.Записать();
			
			Исключение ; КонецПопытки;
			Справочники.IP_Softfone.ПолучитьФормуСписка().Обновить();
		КонецЕсли;
		
		// классификация входящих событий и перенаправление в обработчики
		//ДанныеСобытия=ДанныеВСоответствие(Данные);
		//	Event=ВРег(СокрЛП(ДанныеСобытия.Получить("Event")));
		Exten=ВРег(СокрЛП(ДанныеСобытия.Получить("Exten")));
		
		CallerIDNum=ВРег(СокрЛП(ДанныеСобытия.Получить("CallerIDNum")));
		Если   		СтрДлина( CallerIDNum)=10 тогда  CallerIDNum="+38"+CallerIDNum ;
		ИначеЕсли   СтрДлина( CallerIDNum)=12 тогда  CallerIDNum="+"+CallerIDNum ;
		КонецЕсли;	
		
		Channel=ЛЕВ(ВРег(СокрЛП(ДанныеСобытия.Получить("Channel"))),6);
		
		Channel_2_Tel=ВРег(СокрЛП(ДанныеСобытия.Получить("Channel")));
		нач=find(Channel_2_Tel,"LOCAL");
		кон=find(Channel_2_Tel,"@");
		Channel_2_Tel=mid(Channel_2_Tel,нач+6,кон-нач-6);
		Если СтрДлина(Channel_2_Tel)=10 тогда  Channel_2_Tel="+38"+Channel_2_Tel ;
		КонецЕсли;
		
		ChannelStateDesc= ВРег(СокрЛП(ДанныеСобытия.Получить("ChannelStateDesc")));
		SubEvent=ВРег(СокрЛП(ДанныеСобытия.Получить("SubEvent")));
		ConnectedLineName= ВРег(СокрЛП(ДанныеСобытия.Получить("ConnectedLineName")));
		DialStatus=ВРег(СокрЛП(ДанныеСобытия.Получить("DialStatus")));
		//	State=ВРег(СокрЛП(ДанныеСобытия.Получить("State")));
		Context  =ВРег(СокрЛП(ДанныеСобытия.Получить("Context")));
		Bridgestate=ВРег(СокрЛП(ДанныеСобытия.Получить("Bridgestate")));
		Uniqueid1 =ЛЕВ(ВРег(СокрЛП(ДанныеСобытия.Получить("Uniqueid1"))),10);
		CallerID1="+380"+Прав(ВРег(СокрЛП(ДанныеСобытия.Получить("CallerID1"))),9);
		CallerID2="+380"+Прав(ВРег(СокрЛП(ДанныеСобытия.Получить("CallerID2"))),9);
		Channel1=ВРег(СокрЛП(ДанныеСобытия.Получить("Channel1")));
		
		//Зафиксирован входящий звонок на Колбек  Интертелекома или на Колбек GOIP32

		Если Event ="NEWCHANNEL" и Context="FROM-TRUNK" и Лев(Exten,2)="44" или Лев(Exten,3)="DID" Тогда
			МояДоработка(CallerIDNum,НомерЗаказаНаСайте,СсылкаНаЗаказ,Ответственный,КонтактноеЛицо);
			Записать_Новый_UniqueID_В_IP_Softfon("Входящий (Абонент->CallBack)",CallerIDNum,ТекущаяДата(),
			КонтактноеЛицо,UniqueID,Ответственный,НомерЗаказаНаСайте,СсылкаНаЗаказ,
			CallerIDNum,Exten);
		КонецЕСли;
		
		//CALLBACK перезванивает на входящий звонок		
		Если (Event = "DIAL") и (SubEvent="BEGIN")
		и Лев(Channel,6)="LOCAL/" и ConnectedLineName="CALLBACK" Тогда
			МояДоработка(Channel_2_Tel,НомерЗаказаНаСайте,СсылкаНаЗаказ,Ответственный,КонтактноеЛицо);
			Записать_Новый_UniqueID_В_IP_Softfon("Входящий (CallBack->Абонент)",Channel_2_Tel,ТекущаяДата(),КонтактноеЛицо,UniqueID,
			Ответственный,НомерЗаказаНаСайте,СсылкаНаЗаказ,CallerIDNum,Channel_2_Tel);
		КонецЕСли  ;
		

		//Зафиксирован входящий звонок на прямой номер
		Если Event = "NEWCHANNEL" и Context="FROM-TRUNK" и Лев(Exten,2)="GO" Тогда
			МояДоработка(CallerIDNum,НомерЗаказаНаСайте,СсылкаНаЗаказ,Ответственный,КонтактноеЛицо);
			Записать_Новый_UniqueID_В_IP_Softfon("Входящий (Абонент->Шлюз)",CallerIDNum,ТекущаяДата(),КонтактноеЛицо,UniqueID,
			Ответственный,НомерЗаказаНаСайте,СсылкаНаЗаказ,CallerIDNum,Exten);
		КонецЕсли;
	
			//Мы набираем абонента
		Если Event ="NEWCHANNEL" и Context="FROM-INTERNAL" и ЗначениеЗаполнено(Exten)
			и ЗначениеЗаполнено(CallerIDNum)   Тогда
	     	МояДоработка("+38"+Прав(Exten,10),НомерЗаказаНаСайте,СсылкаНаЗаказ,Ответственный,КонтактноеЛицо);
			Записать_Новый_UniqueID_В_IP_Softfon("Исходящий","+38"+Прав(Exten,10),ТекущаяДата(),
			КонтактноеЛицо,UniqueID,Ответственный,НомерЗаказаНаСайте,СсылкаНаЗаказ,
			CallerIDNum,Exten);
		КонецЕСли;
		
	
		//Соединились с Абонентом
		Если Event ="BRIDGE" и Bridgestate="LINK" 	и Лев(Channel1,6)<>"LOCAL/"  тогда
		Попытка	
		Tel=Справочники.IP_Softfone.НайтиПоРеквизиту("Uniqueid",Uniqueid1).ПолучитьОбъект().Телефон ;
		Исключение
		Tel=CallerID2;
		КонецПопытки;
	//			Если    CallerID1="+380" или CallerID1="+380443382554" тогда
	//				Tel=CallerID2;
	//			Иначе 
					//Tel=CallerID1;
					
	//			КонецЕсли;
				
				Попытка
					Запрос = Новый Запрос;
					ТекстЗапроса="ВЫБРАТЬ
   		    	    |	IP_Softfone.Код,
   	   		        |	IP_Softfone.Телефон,
   	   		        |	IP_Softfone.Статус
  				    |ИЗ
   	         		|	Справочник.IP_Softfone КАК IP_Softfone
   	            	|ГДЕ
   	    	        |	IP_Softfone.Телефон = &Телефон
   		            |	И IP_Softfone.Статус <> &Статус
					|";
					Запрос.Текст = ТекстЗапроса;
				 	Запрос.УстановитьПараметр("Телефон", Tel);
					Запрос.УстановитьПараметр("Статус", "+");
						                                        
					Результат = Запрос.Выполнить().Выбрать();
					Пока Результат.Следующий() Цикл
						Спр=Справочники.IP_Softfone.НайтиПоКоду(Результат.Код).ПолучитьОбъект() ;
						Спр.Статус ="+" ;
						Спр.Записать();
					КонецЦикла;
	    	    Исключение КонецПопытки;	
		 		Справочники.IP_Softfone.ПолучитьФормуСписка().Обновить();	
		КонецЕсли;
		
		
		
		//Положили трубку тогда запишем в непринятые
		Если Event ="HANGUP"  и ConnectedLineName<>"CALLBACK" тогда
		//	Если ПервыйСеанс = Строка(НомерСеансаИнформационнойБазы()) тогда 
				Попытка
					Справочник=Справочники.IP_Softfone.НайтиПоРеквизиту("Uniqueid",UniqueID).ПолучитьОбъект();
					Если не ЗначениеЗаполнено(Справочник.Статус) тогда
					Справочник.Статус="-";
					КонецЕсли;
					Справочник.Активность="";
					Справочник.Записать();
				Исключение  КонецПопытки;
		//	КонецЕсли;
			Справочники.IP_Softfone.ПолучитьФормуСписка().Обновить();   
	   КонецЕСли  ;
		
	КонецПроцедуры
	
Процедура ОчиститьСправочник_Телефония_Активность()
	////Уберем Из справочника пользователей у которых сеанс завершен аварийно	
	//спр = справочники._Телефония_Активность.Выбрать();
	//Пока спр.Следующий() Цикл
	//		МассивСоединений = ПолучитьСоединенияИнформационнойБазы() ;
	//		Нашли = Ложь;
	//		Для Каждого Соединение Из МассивСоединений Цикл
	//			Если Соединение.НомерСеанса = спр.Код Тогда 
	//				Нашли = истина;
	//				прервать;
	//			КонецЕсли;
	//		КонецЦикла;			
	//	
	//	Если не нашли тогда
	//		сп = спр.ПолучитьОбъект();
	//		сп.Удалить();
	//	Конецесли;
	//КонецЦикла;	
		
КонецПроцедуры
	
Процедура Записать_Новый_UniqueID_В_IP_Softfon(Наименование=неопределено,Телефон=неопределено,
			ВремяЗвонка=неопределено,КонтактноеЛицо=неопределено,
			UniqueID=неопределено,Ответственный=неопределено,
			НомерЗаказаНаСайте=неопределено,СсылкаНаЗаказ=неопределено,
			КтоЗвонит=неопределено ,КомуЗвонит=неопределено);
			Справочник=Справочники.IP_Softfone.СоздатьЭлемент();
			Справочник.Наименование=Наименование;
			Справочник.Телефон=Телефон;
			Справочник.ВремяЗвонка=ВремяЗвонка;
			Справочник.КонтактноеЛицо=КонтактноеЛицо;
			Справочник.Uniqueid=UniqueID;
			Справочник.Ответственный=Ответственный;
			Справочник.НомерСайт=НомерЗаказаНаСайте;			
			Справочник.ПоследнийЗаказПокупателя= СсылкаНаЗаказ;
			Справочник.КтоЗвонит=КтоЗвонит;
			Справочник.КомуЗвонит=КомуЗвонит;
			Справочник.Записать();
			Справочники.IP_Softfone.ПолучитьФормуСписка().Обновить();

КонецПроцедуры
	
Функция Login(Логин,Пароль);

	Если ПустаяСтрока(Логин) Тогда
		Сообщить("Login(). Не указан параметр <Логин>");
		Возврат 0;
	КонецЕсли; 
	
	Если ПустаяСтрока(Пароль) Тогда
		Сообщить("Login(). Не указан параметр <Пароль>");
		Возврат 0;
	КонецЕсли; 
	
	Если _Телефония.Подключено=1 Тогда
		CRLF = Chars.CR + Chars.LF;
		СтрокаКоманды= "Action: Login"+CRLF+
		"Username: "+Логин+CRLF+
		"Secret: "+Пароль+CRLF+CRLF;
		Возврат ВыполнитьКоманду(СтрокаКоманды);
	КонецЕсли; 

КонецФункции // Login

Функция Подключиться(Адрес,Порт,Логин,Пароль) ;
	Попытка
	_Телефония.Подключиться(Адрес,Порт);
	Login(Логин,Пароль);
	Исключение
	Сообщить("Не удалось запустить IP Телефонию, возможно доступ к серверу  недоступен")
	КонецПопытки
КонецФункции

Функция ВыполнитьКоманду(СтрокаКоманды);
	// кроме веб-клиента
	#Если ВебКлиент Тогда
		Возврат 0;
	#КонецЕсли
	CRLF = Chars.CR + Chars.LF;
	// проверка завершения пакета
	Если Найти(СтрокаКоманды,CRLF+CRLF)=0 Тогда
		Сообщить("ВыполнитьКоманду: Неверный формат команды: "+CRLF+СтрокаКоманды);
		Возврат 0;
	КонецЕсли;
	Попытка
		Результат=_Телефония.ВыполнитьКоманду(СтрокаКоманды);
	Исключение
	КонецПопытки;
	Если Результат=1 Тогда
		Возврат Истина;
	КонецЕсли; 
	Возврат Ложь;

КонецФункции // ВыполнитьКоманду()

Функция НаличиеУПользователяWindowsАвторизации(Знач ИмяПользователяИБ) Экспорт
	
	//Если ПустаяСтрока(ИмяПользователяИБ) Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	
	// находим пользователя ИБ
	//ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователяИБ);
	//Если ПользовательИБ = Неопределено Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	
	//Возврат ПользовательИБ.АутентификацияОС;
	
КонецФункции


Процедура ПриНачалеРаботыСистемы()   Экспорт;
	
	ОчиститьСправочник_Телефония_Активность();
	
	ЗагрузитьКомпонентуТелефонии();
	Результат=ИнициализироватьТелефонию();
	ПодключитьсяНажатие(Неопределено);
	Попытка
		Если _Телефония.Подключено = 1 тогда
							 
			Справочник=справочники._Телефония_Активность.СоздатьЭлемент();
			Справочник.Код=НомерСеансаИнформационнойБазы();
			//МассивСоединений = ПолучитьСоединенияИнформационнойБазы() ;
			//Для Каждого Соединение Из МассивСоединений Цикл
			//	Если 	Соединение.НомерСеанса= НомерСеансаИнформационнойБазы() тогда
			//		Справочник.Наименование= Соединение.Пользователь.ПолноеИмя;
			//		прервать;
			//	КонецЕсли;
			//КонецЦикла;	
			Справочник.Наименование=ПараметрыСеанса.ТекущийПользователь;
			Справочник.Записать();
			Сообщить("Телефония подключена");
		КонецЕсли;
	Исключение; КонецПопытки;
КонецПроцедуры

Процедура ПодключитьсяНажатие(Элемент="")
	Если _Телефония=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если ЗначениеЗаполнено(Константы.IP_Адрес.Получить())=Ложь Тогда
		_Телефония=Неопределено;
		Возврат;
	КонецЕсли; 
	Если ЗначениеЗаполнено(Константы.IP_Порт.Получить())=Ложь Тогда
		_Телефония=Неопределено;
		Возврат;
	КонецЕсли; 
	Если ЗначениеЗаполнено(Константы.IP_Логин.Получить())=Ложь Тогда
		_Телефония=Неопределено;
		Возврат;
	КонецЕсли; 
	Если ЗначениеЗаполнено(Константы.IP_Пароль.Получить())=Ложь Тогда
		_Телефония=Неопределено;
		Возврат;
	КонецЕсли;
	
	// подключение и авторизация
	Подключиться(Константы.IP_Адрес.Получить(),Константы.IP_Порт.Получить(),
	Константы.IP_Логин.Получить(),Константы.IP_Пароль.Получить());

	// подписка на получение событий
	ПодписатьсяНаВнешниеСобытия(1);
	
	// указываем класс событий Asterisk, который необходимо получать
	//УстановитьФильтрСобытий("call,agent,command");
	
	//устанавливаем фильтр по внутреннему номеру
	//УстановитьФильтр(ВнутреннийНомер);
	
КонецПроцедуры

Функция ПодписатьсяНаВнешниеСобытия(Режим) Экспорт;
	ТекущийРежим=_Телефония.РежимПрослушивания;
	// корректируем принимаемый параметр
	Режим = ?(Режим<0,0,Режим);
	Режим = ?(Режим>1,1,Режим);
	Если Режим - ТекущийРежим > 0 Тогда
		Попытка
		_Телефония.РежимПрослушивания(Режим);
		Исключение 
		Сообщить("Сервер телефонии недоступен !!!");
		КонецПопытки;
	
	КонецЕсли;
	Возврат _Телефония.РежимПрослушивания;
КонецФункции // ПодписатьсяНаВнешниеСобытия( 

Процедура ОтключитьТелефонию() Экспорт;
	Если _Телефония=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если _Телефония.Подключено=1 Тогда
		Logoff();
		_Телефония.Отключиться();
		Попытка
		Справочник=справочники._Телефония_Активность.НайтиПоКоду(НомерСеансаИнформационнойБазы()).ПолучитьОбъект();
		Справочник.Удалить();
	    Исключение;КонецПопытки;
	КонецЕсли; 
КонецПроцедуры
// Завершения сеанса Asterisk Manager API и закрытие соединения
//
// Возвращаемое значение: 1-команда отправлена, 0-нет
Функция Logoff() Экспорт;

	CRLF = Chars.CR+Chars.LF;
	ТекстКоманды = "Action: Logoff"+CRLF+CRLF;
	Возврат ВыполнитьКоманду(ТекстКоманды);

КонецФункции // Logoff
